app/views/questions/_answer_count.html.slim

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 24]]
---
h4 Answers (#{@question.answers.count}):