app/views/questions/_answer_new.html.slim

div.answer-cont
  p= @question.answers.last.body
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" DESC LIMIT 1  [["question_id", 24]]