app/views/questions/_answers.html.slim

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 9]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" DESC LIMIT 1  [["question_id", 24]]
---
h4 Answers (#{@question.answers.count}):
hr
- @question.answers.each do |answer|