app/controllers/answers_controller.rb

  def create
    @answer = @question.answers.new(answer_params)
    @answer.user = current_user
    @answer.save
---
INSERT INTO "answers" ("body", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Да, я, Мишаня, сам хз."], ["question_id", 9], ["user_id", 1], ["created_at", "2015-12-09 13:23:48.089511"], ["updated_at", "2015-12-09 13:23:48.089511"]]

  def destroy
    @answer = Answer.find(params[:id])
    if current_user && current_user.author_of?(@answer)
      @answer.destroy
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 119]]

  def set_question
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 23]]