app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    @question.user = current_user

    if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Леха, че делать?"], ["body", "Скажи же мне!"], ["user_id", 1], ["created_at", "2015-12-09 13:23:23.297614"], ["updated_at", "2015-12-09 13:23:23.297614"]]

  def destroy
    if current_user.author_of(@question)
      @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 9]]